In [1]:
import pandas as pd
import numpy as np
import matplotlib
from matplotlib import pyplot as plt
%matplotlib inline
matplotlib.rcParams["figure.figsize"]=(20,10)

In [2]:
import os
os.getcwd()

'C:\\Users\\Shahzaib-Salamat\\Downloads\\DS projects'

In [3]:
df1 = pd.read_csv("lahore_housing_prices.csv")
df1.head()

,house_id,Type,Location,Area,Bath(s),Bedroom(s),Price
0,46326643,House,"DHA Defence, Lahore, Punjab",1 Kanal,6,5,75500000
1,46952582,House,"Bahria Orchard, Lahore, Punjab",8 Marla,5,5,25000000
2,47357581,House,"Paragon City, Lahore, Punjab",10 Marla,6,5,47000000
3,47397157,Flat,"Askari, Lahore, Punjab",10 Marla,3,3,28000000
4,43109993,House,"DHA Defence, Lahore, Punjab",8 Marla,5,4,43500000

In [4]:
df1.shape          # rows, columns

(17169, 7)

In [5]:
df1.columns        # column names

Index(['house_id', 'Type', 'Location', 'Area', 'Bath(s)', 'Bedroom(s)',
       'Price'],
      dtype='object')

In [6]:
df1.info()         # data types & missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17169 entries, 0 to 17168
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   house_id    17169 non-null  int64
 1   Type        17169 non-null  object
 2   Location    17169 non-null  object
 3   Area        17169 non-null  object
 4   Bath(s)     17169 non-null  int64
 5   Bedroom(s)  17169 non-null  int64
 6   Price       17169 non-null  int64
dtypes: int64(4), object(3)
memory usage: 939.1+ KB

In [7]:
df1.describe()     # stats for numeric columns

           house_id       Bath(s)    Bedroom(s)         Price
count  1.716900e+04  17169.000000  17169.000000  1.716900e+04
mean   4.655362e+07      4.716233      4.183820  4.758766e+07
std    1.796472e+06      1.329716      1.294566  5.467632e+07
min    6.872350e+05      1.000000      1.000000  1.150000e+05
25%    4.652353e+07      4.000000      3.000000  1.800000e+07
50%    4.706818e+07      5.000000      4.000000  3.200000e+07
75%    4.731195e+07      6.000000      5.000000  6.000000e+07
max    4.739719e+07     10.000000     11.000000  7.171000e+08

In [8]:
df1.head()

,house_id,Type,Location,Area,Bath(s),Bedroom(s),Price
0,46326643,House,"DHA Defence, Lahore, Punjab",1 Kanal,6,5,75500000
1,46952582,House,"Bahria Orchard, Lahore, Punjab",8 Marla,5,5,25000000
2,47357581,House,"Paragon City, Lahore, Punjab",10 Marla,6,5,47000000
3,47397157,Flat,"Askari, Lahore, Punjab",10 Marla,3,3,28000000
4,43109993,House,"DHA Defence, Lahore, Punjab",8 Marla,5,4,43500000

In [9]:
df2 = df1.copy()

In [10]:
df2.isnull().sum()

house_id      0
Type          0
Location      0
Area          0
Bath(s)       0
Bedroom(s)    0
Price         0
dtype: int64

In [11]:
df2['Area'] = (
    df2['Area']
    .str.replace('Marla', '', regex=False)
    .str.strip()
)

df2['Area'] = pd.to_numeric(df2['Area'], errors='coerce')

In [12]:
df2.isnull().sum()

house_id         0
Type             0
Location         0
Area          4724
Bath(s)          0
Bedroom(s)       0
Price            0
dtype: int64

In [13]:
df2 = df2.dropna(subset=['Area'])

In [14]:
df2.isnull().sum()

house_id      0
Type          0
Location      0
Area          0
Bath(s)       0
Bedroom(s)    0
Price         0
dtype: int64

In [15]:
df2.shape

(12445, 7)

In [16]:
df2.head()

,house_id,Type,Location,Area,Bath(s),Bedroom(s),Price
1,46952582,House,"Bahria Orchard, Lahore, Punjab",8.0,5,5,25000000
2,47357581,House,"Paragon City, Lahore, Punjab",10.0,6,5,47000000
3,47397157,Flat,"Askari, Lahore, Punjab",10.0,3,3,28000000
4,43109993,House,"DHA Defence, Lahore, Punjab",8.0,5,4,43500000
5,47357357,House,"Paragon City, Lahore, Punjab",10.0,5,4,48000000

In [17]:
df2['Type'].value_counts()

Type
House        11294
Flat          1146
Penthouse        3
Room             2
Name: count, dtype: int64

In [18]:
df3 = df2.copy()

In [19]:
df3 = df3[~df3['Type'].isin(['Penthouse', 'Room'])].copy()
df3.head()

,house_id,Type,Location,Area,Bath(s),Bedroom(s),Price
1,46952582,House,"Bahria Orchard, Lahore, Punjab",8.0,5,5,25000000
2,47357581,House,"Paragon City, Lahore, Punjab",10.0,6,5,47000000
3,47397157,Flat,"Askari, Lahore, Punjab",10.0,3,3,28000000
4,43109993,House,"DHA Defence, Lahore, Punjab",8.0,5,4,43500000
5,47357357,House,"Paragon City, Lahore, Punjab",10.0,5,4,48000000

In [20]:
df3['Type'].value_counts()

Type
House    11294
Flat      1146
Name: count, dtype: int64

In [21]:
df3.reset_index(drop=True, inplace=True)

In [22]:
df3['Type'].value_counts()

Type
House    11294
Flat      1146
Name: count, dtype: int64

In [23]:
df3.head()

,house_id,Type,Location,Area,Bath(s),Bedroom(s),Price
0,46952582,House,"Bahria Orchard, Lahore, Punjab",8.0,5,5,25000000
1,47357581,House,"Paragon City, Lahore, Punjab",10.0,6,5,47000000
2,47397157,Flat,"Askari, Lahore, Punjab",10.0,3,3,28000000
3,43109993,House,"DHA Defence, Lahore, Punjab",8.0,5,4,43500000
4,47357357,House,"Paragon City, Lahore, Punjab",10.0,5,4,48000000

In [24]:
df3.shape

(12440, 7)

In [25]:
df3['Type'].unique()

array(['House', 'Flat'], dtype=object)

In [26]:
df3['Location'].unique()

array(['Bahria Orchard, Lahore, Punjab', 'Paragon City, Lahore, Punjab',
       'Askari, Lahore, Punjab', 'DHA Defence, Lahore, Punjab',
       'Khayaban-e-Amin, Lahore, Punjab',
       'Nishtar Colony, Lahore, Punjab',
       'Central Park Housing Scheme, Lahore, Punjab',
       'New Lahore City, Lahore, Punjab',
       'Bahria Nasheman, Lahore, Punjab', 'Bahria Town, Lahore, Punjab',
       'Eden, Lahore, Punjab',
       'Bankers Avenue Cooperative Housing Society, Lahore, Punjab',
       'Raiwind Road, Lahore, Punjab', 'Johar Town, Lahore, Punjab',
       'Highcourt Society, Lahore, Punjab',
       'Thokar Niaz Baig, Lahore, Punjab',
       'Military Accounts Housing Society, Lahore, Punjab',
       'Defence Road, Lahore, Punjab', 'Multan Road, Lahore, Punjab',
       'Jubilee Town, Lahore, Punjab',
       'Punjab University Employees Society, Lahore, Punjab',
       'Al Noor Park Housing Society, Lahore, Punjab',
       'Park View City, Lahore, Punjab', 'Mughalpura, Lahore, Punjab',
       'GT Road, Lahore, Punjab',
       'Rail Town (Canal City), Lahore, Punjab',
       'Green City, Lahore, Punjab',
       'Lahore Medical Housing Society, Lahore, Punjab',
       'College Road, Lahore, Punjab', 'Ferozepur Road, Lahore, Punjab',
       'Architects Engineers Housing Society, Lahore, Punjab',
       'Sunfort Gardens, Lahore, Punjab', 'Canal Garden, Lahore, Punjab',
       'Kahna, Lahore, Punjab', 'Sanda, Lahore, Punjab',
       'Gulberg, Lahore, Punjab', 'DHA 11 Rahbar, Lahore, Punjab',
       'Izmir Town, Lahore, Punjab', 'LDA Avenue, Lahore, Punjab',
       'Gulshan-e-Ravi, Lahore, Punjab',
       'State Life Housing Society, Lahore, Punjab',
       'Punjab Coop Housing Society, Lahore, Punjab',
       'Sue-e-Asal, Lahore, Punjab', 'EME Society, Lahore, Punjab',
       'Sheraz Town, Lahore, Punjab', 'Allama Iqbal Town, Lahore, Punjab',
       'Al Rehman Garden, Lahore, Punjab',
       'Main Canal Bank Road, Lahore, Punjab',
       'OPF Housing Scheme, Lahore, Punjab',
       'Nasheman-e-Iqbal, Lahore, Punjab',
       'Gulshan-e-Lahore, Lahore, Punjab', 'Wapda Town, Lahore, Punjab',
       'Peco Road, Lahore, Punjab', 'Pine Avenue, Lahore, Punjab',
       'IEP Engineers Town, Lahore, Punjab',
       'Pak Arab Housing Society, Lahore, Punjab',
       'Abid Road, Lahore, Punjab',
       'Vital Homes Housing Scheme, Lahore, Punjab',
       'Sabzazar Scheme, Lahore, Punjab', 'Tariq Gardens, Lahore, Punjab',
       'Shadab Garden, Lahore, Punjab',
       'Venus Housing Scheme, Lahore, Punjab',
       'Bedian Road, Lahore, Punjab', 'Harbanspura, Lahore, Punjab',
       'Ghous Garden, Lahore, Punjab', 'Canal Fort II, Lahore, Punjab',
       'Tricon Village, Lahore, Punjab', 'Icon Valley, Lahore, Punjab',
       'Nawab Town, Lahore, Punjab', 'Mozang, Lahore, Punjab',
       'Dream Avenue Lahore, Lahore, Punjab',
       'Chaudhary Colony, Lahore, Punjab',
       'Formanites Housing Scheme, Lahore, Punjab',
       'Chungi Amar Sadhu, Lahore, Punjab', 'Faisal Town, Lahore, Punjab',
       'IBL Housing Scheme, Lahore, Punjab', 'NFC 1, Lahore, Punjab',
       'PCSIR Housing Scheme, Lahore, Punjab',
       'Shoukat Town, Lahore, Punjab',
       'Valencia Housing Society, Lahore, Punjab',
       'Sukh Chayn Gardens, Lahore, Punjab', 'Cantt, Lahore, Punjab',
       'Rehmanpura (Ferozpur Road), Lahore, Punjab',
       'Shalimar Link Road, Lahore, Punjab',
       'Al-Hamd Park, Lahore, Punjab', 'Divine Gardens, Lahore, Punjab',
       'TIP Housing Society, Lahore, Punjab',
       'Park Avenue Housing Scheme, Lahore, Punjab',
       'Ashraf Garden, Lahore, Punjab', 'Ichhra, Lahore, Punjab',
       'Rehan Garden, Lahore, Punjab',
       'Audit & Accounts Housing Society, Lahore, Punjab',
       'Rizwan Garden Scheme, Lahore, Punjab',
       'Wagha Town, Lahore, Punjab', 'PIA Housing Scheme, Lahore, Punjab',
       'Manawan, Lahore, Punjab', 'Al-Hafiz Town, Lahore, Punjab',
       'Lahore Motorway City, Lahore, Punjab',
       'Fazaia Housing Scheme, Lahore, Punjab',
       'Cavalry Extension, Lahore, Punjab',
       'Punjab Small Industries Colony, Lahore, Punjab',
       'Iqbal Park, Lahore, Punjab', 'Rehman Villas, Lahore, Punjab',
       'Hamza Town, Lahore, Punjab', 'Bagarian, Lahore, Punjab',
       'Revenue Society, Lahore, Punjab',
       'Bankers Co-operative Housing Society, Lahore, Punjab',
       'Shalimar Housing Scheme, Lahore, Punjab',
       'Kamahan Road, Lahore, Punjab', 'Township, Lahore, Punjab',
       'Sami Town, Lahore, Punjab',
       'Marghzar Officers Colony, Lahore, Punjab',
       'Lahore - Kasur Road, Lahore, Punjab',
       'City Life Homes, Lahore, Punjab', 'Model Town, Lahore, Punjab',
       'Garden Town, Lahore, Punjab',
       'Punjab Govt Employees Society, Lahore, Punjab',
       'Noor Jahan Road, Lahore, Punjab',
       'Public Health Society, Lahore, Punjab',
       'Grand Avenues Housing Scheme, Lahore, Punjab',
       'New Super Town, Lahore, Punjab', 'Shanghai Road, Lahore, Punjab',
       'Tajpura, Lahore, Punjab', 'Walton Road, Lahore, Punjab',
       'UET Housing Society, Lahore, Punjab',
       'Bankers Town, Lahore, Punjab',
       'Shershah Colony - Raiwind Road, Lahore, Punjab',
       'Al-Hamad Colony (AIT), Lahore, Punjab',
       'Taj Bagh Scheme, Lahore, Punjab',
       'Canal Bank Housing Scheme, Lahore, Punjab',
       'Shahdara, Lahore, Punjab', 'Cantt View Society, Lahore, Punjab',
       'Ahlu Road, Lahore, Punjab', 'Cavalry Ground, Lahore, Punjab',
       'Zaheer Villas, Lahore, Punjab', 'Habib Homes, Lahore, Punjab',
       'T & T Aabpara Housing Society, Lahore, Punjab',
       'Muslim Town, Lahore, Punjab', 'Baghbanpura, Lahore, Punjab',
       'Lalazaar Garden, Lahore, Punjab', 'Manhala Road, Lahore, Punjab',
       'Defence Fort, Lahore, Punjab',
       'Rehman Housing Society, Lahore, Punjab',
       'Gulshan View Residence Society, Lahore, Punjab',
       'Atari Saroba, Lahore, Punjab', 'Jamal Homes, Lahore, Punjab',
       'Samanabad, Lahore, Punjab', 'Raj Garh, Lahore, Punjab',
       'Islampura, Lahore, Punjab', 'Super Town, Lahore, Punjab',
       'Sharaqpur Road, Lahore, Punjab',
       'Al-Qayyum Garden, Lahore, Punjab', 'Shah Jamal, Lahore, Punjab',
       'Chughtai Garden, Lahore, Punjab',
       'Airline Housing Society, Lahore, Punjab',
       'Al Jalil Garden, Lahore, Punjab',
       'HBFC Housing Society, Lahore, Punjab',
       'Davis Road, Lahore, Punjab',
       'West Wood Housing Society, Lahore, Punjab',
       'Ashiana-e-Quaid Housing Scheme, Lahore, Punjab',
       'Alfalah Town, Lahore, Punjab',
       'Land Breeze Housing Society, Lahore, Punjab',
       'Samanzar Colony, Lahore, Punjab', 'Toheed Park, Lahore, Punjab',
       'New Chauburji Park, Lahore, Punjab',
       'Chinar Bagh, Lahore, Punjab', 'Krishan Nagar, Lahore, Punjab',
       'Jail Road, Lahore, Punjab', 'Lawrence Road, Lahore, Punjab',
       'Eden Avenue Extension, Lahore, Punjab',
       'Sheraz Villas, Lahore, Punjab',
       'Islamabad Colony, Lahore, Punjab', 'Heir, Lahore, Punjab',
       'Manawala, Lahore, Punjab', 'New Samanabad, Lahore, Punjab',
       'UMT Society, Lahore, Punjab', 'Waris Road, Lahore, Punjab',
       'Shahtaj Colony, Lahore, Punjab', 'Maryam Town, Lahore, Punjab',
       'Rewaz Garden, Lahore, Punjab', 'Mateen Avenue, Lahore, Punjab',
       'Royal Residencia, Lahore, Punjab', 'Jallo, Lahore, Punjab',
       'Lahore Canal Bank Cooperative Housing Society, Lahore, Punjab',
       'Garhi Shahu, Lahore, Punjab',
       'Punjab Government Servant Housing Foundation, Lahore, Punjab',
       'Ring Road, Lahore, Punjab', 'Mohafiz Town, Lahore, Punjab',
       'PCSIR Staff Colony, Lahore, Punjab',
       'Chaman Park, Lahore, Punjab', 'Zohra Homes, Lahore, Punjab',
       'Zaitoon City, Lahore, Punjab', 'Rifle Range Road, Lahore, Punjab',
       'Rehman Gardens, Lahore, Punjab', 'Al Hamra Town, Lahore, Punjab',
       'Sham Nagar, Lahore, Punjab', 'Ilyas Colony, Lahore, Punjab',
       'Azam Gardens, Lahore, Punjab', 'Iqbal Avenue, Lahore, Punjab',
       'Awan Town, Lahore, Punjab', 'Clifton Colony, Lahore, Punjab',
       'Al Haram Garden, Lahore, Punjab', 'Guldasht Town, Lahore, Punjab',
       'Gulbahar Colony, Lahore, Punjab',
       'Green Cap Housing Society, Lahore, Punjab',
       'Elite Town, Lahore, Punjab', 'Gosha-e-Ahbab, Lahore, Punjab',
       'Al Madina Avenue, Lahore, Punjab',
       'BOR - Board of Revenue Housing Society, Lahore, Punjab',
       'Omega Homes, Lahore, Punjab',
       'Khayaban-e-Jinnah Road, Lahore, Punjab',
       'Mustafa Town, Lahore, Punjab', 'Singhpura, Lahore, Punjab',
       'Afzal Park, Lahore, Punjab', 'Shah Alam Market, Lahore, Punjab',
       'Walton Railway Officers Colony, Lahore, Punjab',
       'Wahdat Colony, Lahore, Punjab', 'Sahafi Colony, Lahore, Punjab',
       'Aitchison Society, Lahore, Punjab',
       'Aashiana Road, Lahore, Punjab',
       'UBL Housing Society, Lahore, Punjab',
       'Sher Ali Road, Lahore, Punjab', 'PAF Colony, Lahore, Punjab',
       'Islamia Park, Lahore, Punjab', 'Rasool Park, Lahore, Punjab',
       'Canal Burg, Lahore, Punjab', 'Real Cottages, Lahore, Punjab',
       'Emerald City, Lahore, Punjab', 'Shadbagh, Lahore, Punjab',
       'Green Town Sector D2, Lahore, Punjab',
       'Al Faisal Town, Lahore, Punjab',
       'Bahar Shah Road, Lahore, Punjab',
       'Hanif Park Harbanspura, Lahore, Punjab',
       'Sajid Garden, Lahore, Punjab', 'Begampura, Lahore, Punjab',
       'Lahore Villas, Lahore, Punjab',
       'Kacha Ferozepur Road, Lahore, Punjab',
       'Civil Defence, Lahore, Punjab', 'Garrison Homes, Lahore, Punjab',
       'Bhatta Chowk, Lahore, Punjab',
       'Shahzada New Abadi, Lahore, Punjab',
       'Hassan Town, Lahore, Punjab',
       'Abdalians Cooperative Housing Society, Lahore, Punjab',
       'Al-Hafeez Garden Road, Lahore, Punjab',
       'Rehmanpura (Harbanspura), Lahore, Punjab',
       'Salamatpura, Lahore, Punjab', 'Zaman Colony, Lahore, Punjab',
       'National Town, Lahore, Punjab', 'Batapur, Lahore, Punjab',
       'Sultan Town, Lahore, Punjab',
       'Mehar Fayaz Colony, Lahore, Punjab', 'Fateh Garh, Lahore, Punjab',
       'Ittehad Park, Lahore, Punjab',
       'Excise & Taxation Housing Scheme, Lahore, Punjab',
       'Nishat Colony, Lahore, Punjab',
       'Nazir Garden Society, Lahore, Punjab',
       'Saqib Town, Lahore, Punjab', 'Mughal Homes, Lahore, Punjab',
       'Mansoorah, Lahore, Punjab', 'Saidpur, Lahore, Punjab',
       'Dubban Pura, Lahore, Punjab', 'Karim Park, Lahore, Punjab',
       'P & D Housing Society, Lahore, Punjab',
       'Beacon House Society, Lahore, Punjab',
       'Saroba Gardens Housing Society, Lahore, Punjab',
       'Gulgasht Colony Rustam Park, Lahore, Punjab',
       'Sant Nagar, Lahore, Punjab', 'Mustafabad Lalyani, Lahore, Punjab',
       'Atomic Energy Society - PAEC, Lahore, Punjab',
       'Circular Road, Lahore, Punjab',
       'Qilla Gujjar Singh, Lahore, Punjab',
       'Government Employees Cooperative Housing Society (GECHS), Lahore, Punjab',
       'Lahore - Jaranwala Road, Lahore, Punjab',
       'Sui Gas Housing Society, Lahore, Punjab',
       'Bahria Education & Medical City, Lahore, Punjab',
       'Education Town, Lahore, Punjab', 'Pakki Thatti, Lahore, Punjab',
       'Green Acres Housing Society, Lahore, Punjab',
       'Dubai Town, Lahore, Punjab', 'Khayaban-e-Quaid, Lahore, Punjab',
       'Sadhoke, Lahore, Punjab', 'Canal View, Lahore, Punjab',
       'Aman Town, Lahore, Punjab', 'Ahmad Avenue, Lahore, Punjab',
       'Malipura, Lahore, Punjab', 'Mian Amiruddin Park, Lahore, Punjab',
       'Khayaban-e-Zohra, Lahore, Punjab',
       'Ali Alam Garden, Lahore, Punjab', 'Sozo Town, Lahore, Punjab',
       'Hajvery Housing Scheme, Lahore, Punjab',
       'Daroghewala, Lahore, Punjab', 'Gul Kali, Lahore, Punjab',
       'Al-Hamd Garden, Lahore, Punjab', 'Islam Nagar, Lahore, Punjab',
       'Wafaqi Colony, Lahore, Punjab', 'Green Park, Lahore, Punjab',
       'Qartaba Chowk, Lahore, Punjab', 'Al Hamad Colony, Lahore, Punjab',
       'Rajgarh Road, Lahore, Punjab',
       'Sadat Cooperative Housing Society (College Town), Lahore, Punjab',
       'Naz Town, Lahore, Punjab', 'Sadaat Town, Lahore, Punjab',
       'Chauburji, Lahore, Punjab', 'PIA Main Boulevard, Lahore, Punjab',
       'Jamil Town, Lahore, Punjab', 'Gajju Matah, Lahore, Punjab',
       'Khayaban-e-Zafar, Lahore, Punjab', 'Abbot Road, Lahore, Punjab',
       'Lytton Road, Lahore, Punjab', 'Ali Town, Lahore, Punjab',
       'Madina Colony, Lahore, Punjab', 'Rehman Park, Lahore, Punjab'],
      dtype=object)

In [27]:
df3['Location'] = df3['Location'].apply(lambda x: x.strip().replace(', Lahore, Punjab', ''))
df3.head()

   house_id   Type        Location  Area  Bath(s)  Bedroom(s)     Price
0  46952582  House  Bahria Orchard   8.0        5           5  25000000
1  47357581  House    Paragon City  10.0        6           5  47000000
2  47397157   Flat          Askari  10.0        3           3  28000000
3  43109993  House     DHA Defence   8.0        5           4  43500000
4  47357357  House    Paragon City  10.0        5           4  48000000

In [28]:
location_stats = df3['Location'].value_counts(ascending=False)
print(location_stats)

# Locations with 10 or fewer data points
locations_less_than_10 = location_stats[location_stats <= 10]
print(f"\nNumber of unique locations to be grouped: {len(locations_less_than_10)}")

Location
DHA Defence                       1685
Bahria Town                       1603
Askari                             800
Raiwind Road                       532
Johar Town                         464
                                  ...
Aitchison Society                    1
Wahdat Colony                        1
Walton Railway Officers Colony       1
Shah Alam Market                     1
Rehman Park                          1
Name: count, Length: 312, dtype: int64

Number of unique locations to be grouped: 216

In [29]:
df3['Location'] = df3['Location'].apply(lambda x: 'other' if x in locations_less_than_10 else x)

# Check how many unique locations we have now
print(f"Unique locations remaining: {len(df3['Location'].unique())}")

Unique locations remaining: 97

In [30]:
df3.head(12440)

       house_id   Type          Location  Area  Bath(s)  Bedroom(s)     Price
0      46952582  House    Bahria Orchard   8.0        5           5  25000000
1      47357581  House      Paragon City  10.0        6           5  47000000
2      47397157   Flat            Askari  10.0        3           3  28000000
3      43109993  House       DHA Defence   8.0        5           4  43500000
4      47357357  House      Paragon City  10.0        5           4  48000000
...         ...    ...               ...   ...      ...         ...       ...
12435  43967153  House       DHA Defence  12.0        6           5  76500000
12436  47286996  House  Thokar Niaz Baig   3.0        3           3   8100000
12437  45572161  House       DHA Defence  10.0        4           3  39000000
12438  45309378  House       DHA Defence   5.0        4           3  28000000
12439  46962294  House       DHA Defence  10.0        5           4  55000000

[12440 rows x 7 columns]

In [31]:
# Show rows where bathrooms are way more than bedrooms
errors = df3[df3['Bath(s)'] > df3['Bedroom(s)'] + 2]
errors

       house_id   Type          Location  Area  Bath(s)  Bedroom(s)     Price
296    46570472  House       Bahria Town   5.0        6           3  18500000
1305   41587943  House       Bahria Town   5.0        6           3  17500000
1840   46980369  House       DHA Defence   5.0        6           3  17200000
9397   46639309  House       Bahria Town  10.0        6           3  30000000
9835   46034637  House  Al Rehman Garden   4.0        6           3  13000000
10726  47199153  House    Bahria Orchard   6.0        6           3  18000000

In [32]:
# 1. Define the list of indices you want to remove
indices_to_drop = [296, 1305, 1840, 9397, 9835, 10726]

# 2. Drop the rows by index
# We use errors='ignore' just in case a row was already dropped in a previous cell
df3 = df3.drop(indices_to_drop, axis=0, errors='ignore')

# 3. Reset the index again to keep it clean
df3.reset_index(drop=True, inplace=True)

# 4. Check the result
print(f"Current rows in dataset: {df3.shape[0]}")
df3.head()

Current rows in dataset: 12434

   house_id   Type        Location  Area  Bath(s)  Bedroom(s)     Price
0  46952582  House  Bahria Orchard   8.0        5           5  25000000
1  47357581  House    Paragon City  10.0        6           5  47000000
2  47397157   Flat          Askari  10.0        3           3  28000000
3  43109993  House     DHA Defence   8.0        5           4  43500000
4  47357357  House    Paragon City  10.0        5           4  48000000

In [33]:
errors = df3[df3['Bath(s)'] > df3['Bedroom(s)'] + 2]
errors

Empty DataFrame
Columns: [house_id, Type, Location, Area, Bath(s), Bedroom(s), Price]
Index: []

In [34]:
len(df3['Location'].unique())

97

In [35]:
# Create a temporary column to check Price per Marla
df3['price_per_marla'] = df3['Price'] / df3['Area']

# View the stats
df3['price_per_marla'].describe()

count    1.243400e+04
mean     3.761784e+06
std      1.719366e+06
min      4.090909e+04
25%      3.100000e+06
50%      3.680000e+06
75%      4.375000e+06
max      1.250000e+08
Name: price_per_marla, dtype: float64

In [36]:
df3.head()

,house_id,Type,Location,Area,Bath(s),Bedroom(s),Price,price_per_marla
0,46952582,House,Bahria Orchard,8.0,5,5,25000000,3125000.0
1,47357581,House,Paragon City,10.0,6,5,47000000,4700000.0
2,47397157,Flat,Askari,10.0,3,3,28000000,2800000.0
3,43109993,House,DHA Defence,8.0,5,4,43500000,5437500.0
4,47357357,House,Paragon City,10.0,5,4,48000000,4800000.0

In [37]:
df3['Location'].unique()

array(['Bahria Orchard', 'Paragon City', 'Askari', 'DHA Defence',
       'Khayaban-e-Amin', 'other', 'Central Park Housing Scheme',
       'New Lahore City', 'Bahria Nasheman', 'Bahria Town', 'Eden',
       'Bankers Avenue Cooperative Housing Society', 'Raiwind Road',
       'Johar Town', 'Thokar Niaz Baig',
       'Military Accounts Housing Society', 'Defence Road', 'Multan Road',
       'Jubilee Town', 'Punjab University Employees Society',
       'Al Noor Park Housing Society', 'Park View City', 'GT Road',
       'Green City', 'Lahore Medical Housing Society', 'College Road',
       'Ferozepur Road', 'Architects Engineers Housing Society',
       'Canal Garden', 'Kahna', 'Gulberg', 'DHA 11 Rahbar', 'Izmir Town',
       'LDA Avenue', 'Gulshan-e-Ravi', 'State Life Housing Society',
       'Punjab Coop Housing Society', 'EME Society', 'Allama Iqbal Town',
       'Al Rehman Garden', 'Main Canal Bank Road', 'OPF Housing Scheme',
       'Nasheman-e-Iqbal', 'Gulshan-e-Lahore', 'Wapda Town',
       'IEP Engineers Town', 'Pak Arab Housing Society',
       'Vital Homes Housing Scheme', 'Sabzazar Scheme', 'Tariq Gardens',
       'Shadab Garden', 'Bedian Road', 'Harbanspura', 'Ghous Garden',
       'Canal Fort II', 'Nawab Town', 'Formanites Housing Scheme',
       'Chungi Amar Sadhu', 'Faisal Town', 'NFC 1',
       'PCSIR Housing Scheme', 'Valencia Housing Society', 'Cantt',
       'Al-Hamd Park', 'Divine Gardens', 'Park Avenue Housing Scheme',
       'Ichhra', 'Audit & Accounts Housing Society', 'PIA Housing Scheme',
       'Al-Hafiz Town', 'Lahore Motorway City', 'Fazaia Housing Scheme',
       'Cavalry Extension', 'Punjab Small Industries Colony',
       'Hamza Town', 'Bankers Co-operative Housing Society', 'Township',
       'Marghzar Officers Colony', 'Model Town', 'Garden Town',
       'Punjab Govt Employees Society', 'Walton Road',
       'UET Housing Society', 'Shershah Colony - Raiwind Road',
       'Al-Hamad Colony (AIT)', 'Taj Bagh Scheme',
       'Canal Bank Housing Scheme', 'Cavalry Ground', 'Lalazaar Garden',
       'Samanabad', 'Super Town', 'Jail Road', 'Shahtaj Colony',
       'PCSIR Staff Colony', 'Awan Town', 'Green Cap Housing Society',
       'Elite Town'], dtype=object)

In [38]:
def filter_by_market_logic(df):
    # 1. DHA Logic: 8 million to 10 million per marla
    dha_mask = (df['Location'] == 'DHA Defence')
    df = df[~(dha_mask & ((df['price_per_marla'] < 8000000) | (df['price_per_marla'] > 10000000)))]
    
    # 2. Johar/Bahria Logic: Slightly less than DHA (e.g., 5 million to 8 million)
    # Adjusting based on your 'slightly less' description
    mid_mask = (df['Location'].isin(['Johar Town', 'Bahria Town']))
    df = df[~(mid_mask & ((df['price_per_marla'] < 5000000) | (df['price_per_marla'] > 80000000)))]
    
    # 3. Others: 50k to 3 Lac per marla
    # We apply this to everything else
    other_mask = (~df['Location'].isin(['DHA Defence', 'Johar Town', 'Bahria Town']))
    df = df[~(other_mask & ((df['price_per_marla'] < 50000) | (df['price_per_marla'] > 3000000)))]
    
    return df

# Apply your specific market knowledge
df4 = filter_by_market_logic(df3)

print(f"Rows remaining after applying your market logic: {len(df4)}")

Rows remaining after applying your market logic: 2819

In [39]:
def find_price_anomalies(df):
    anomalies = []
    # Group by Location and Area (Size)
    for (location, area), group in df.groupby(['Location', 'Area']):
        # Get all 2-bedroom houses in this group
        bed2 = group[group['Bedroom(s)'] == 2]
        # Get all 3-bedroom houses in this group
        bed3 = group[group['Bedroom(s)'] == 3]
        
        if not bed2.empty and not bed3.empty:
            max_price_2bed = bed2['Price'].max()
            min_price_3bed = bed3['Price'].min()
            
            # If the most expensive 2-bed is more than the cheapest 3-bed
            if max_price_2bed > min_price_3bed:
                anomalies.append(group)
                
    return pd.concat(anomalies) if anomalies else pd.DataFrame()

# Run the check on your cleaned data
price_anomalies = find_price_anomalies(df4)
price_anomalies.head(10)

,house_id,Type,Location,Area,Bath(s),Bedroom(s),Price,price_per_marla
1473,46831731,House,Al Rehman Garden,3.0,5,3,8200000,2.733333e+06
1840,44925736,House,Al Rehman Garden,3.0,4,3,8000000,2.666667e+06
1855,46912793,House,Al Rehman Garden,3.0,4,3,8500000,2.833333e+06
1964,47251717,House,Al Rehman Garden,3.0,5,4,8300000,2.766667e+06
7051,45724849,House,Al Rehman Garden,3.0,2,2,8500000,2.833333e+06
7077,45921629,House,Al Rehman Garden,3.0,3,3,7000000,2.333333e+06
7597,45904945,House,Al Rehman Garden,3.0,2,1,6200000,2.066667e+06
7601,45902982,House,Al Rehman Garden,3.0,4,3,9000000,3.000000e+06
7879,46247651,House,Al Rehman Garden,3.0,4,3,8800000,2.933333e+06
7920,45904342,House,Al Rehman Garden,3.0,5,4,9000000,3.000000e+06

In [40]:
df5=df4.copy()

In [41]:
# 1. Create a copy to keep your data safe
df_final = df5.copy()

# 2. Convert 'Type' to binary (1 for House, 0 for Flat)
# We use 'str.contains' just in case there are spaces
df_final['Type'] = df_final['Type'].apply(lambda x: 1 if str(x).strip() == 'House' else 0)

# 3. DROP the text columns that are causing the error
# We remove 'Location' because we already have the dummy columns for it
columns_to_drop = ['Location']
if 'price_per_marla' in df_final.columns:
    columns_to_drop.append('price_per_marla')

df_final = df_final.drop(columns_to_drop, axis='columns', errors='ignore')

# 4. Now convert to int (True becomes 1, False becomes 0)
df_final = df_final.astype(int)

print("Success! Dataframe is now all numeric.")
print(f"Final Shape: {df_final.shape}")
df_final.head()

Success! Dataframe is now all numeric.
Final Shape: (2819, 6)

    house_id  Type  Area  Bath(s)  Bedroom(s)     Price
2   47397157     0    10        3           3  28000000
9   47341671     1     5        2           2   6900000
10  47397153     0    10        4           3  27200000
13  47179318     1     2        3           3   5500000
19  46836160     1    10        6           4  26000000

In [42]:
# 1. Get the dummy variables for the locations in your filtered data
dummies = pd.get_dummies(df4.Location)

# 2. Concatenate the dummies with your cleaned numeric columns
# We drop 'other' to avoid the dummy variable trap
df_ready = pd.concat([df_final, dummies.drop('other', axis='columns', errors='ignore')], axis='columns')

# 3. Final check: You should see 'Type', 'Area', etc. followed by 100+ location columns
print(f"Final shape for training: {df_ready.shape}")
df_ready.head()

Final shape for training: (2819, 94)

,house_id,Type,Area,Bath(s),Bedroom(s),Price,Al Noor Park Housing Society,Al Rehman Garden,Al-Hafiz Town,Al-Hamad Colony (AIT),...,State Life Housing Society,Super Town,Taj Bagh Scheme,Thokar Niaz Baig,Township,UET Housing Society,Valencia Housing Society,Vital Homes Housing Scheme,Walton Road,Wapda Town
2,47397157,0,10,3,3,28000000,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
9,47341671,1,5,2,2,6900000,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
10,47397153,0,10,4,3,27200000,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
13,47179318,1,2,3,3,5500000,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
19,46836160,1,10,6,4,26000000,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [43]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

# X is our features (everything except Price)
X = df_ready.drop('Price', axis='columns')

# y is our target (Price)
y = df_ready['Price']

# Split the data
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=10)

# Initialize and Train the model
lr_clf = LinearRegression()
lr_clf.fit(X_train, y_train)

# Check the accuracy
score = lr_clf.score(X_test, y_test)
print(f"Model Accuracy (R-squared): {score * 100:.2f}%")

Model Accuracy (R-squared): 91.47%

In [44]:
import numpy as np

def predict_price(location, area, bath, bed, is_house):    
    # 1. Find the column index for the location
    try:
        loc_index = np.where(X.columns == location)[0][0]
    except:
        loc_index = -1

    # 2. Create an array of 0s
    x_input = np.zeros(len(X.columns))
    x_input[0] = 1 if is_house == 'House' else 0
    x_input[1] = area
    x_input[2] = bath
    x_input[3] = bed
    
    if loc_index >= 0:
        x_input[loc_index] = 1

    # 3. FIX: Convert the array into a DataFrame with feature names
    x_df = pd.DataFrame([x_input], columns=X.columns)

    # 4. Predict using the DataFrame instead of the array
    prediction = lr_clf.predict(x_df)[0]
    return f"Estimated Price: {prediction:,.0f} PKR"

In [45]:
print(predict_price('DHA Defence', 5, 4, 4, 'House'))

Estimated Price: 56,861,566 PKR

In [46]:
print(predict_price('Bahria Town', 10, 5, 4, 'House'))

Estimated Price: 48,127,259 PKR

In [47]:
print(predict_price('Al Rehman Garden', 3, 2, 2, 'House'))

Estimated Price: 5,819,572 PKR

In [48]:
print(predict_price('Askari', 10, 3, 3, 'House'))

Estimated Price: 29,134,412 PKR

In [49]:
import pickle
import json

# 1. Save the model to a pickle file
with open('lahore_home_prices_model.pickle', 'wb') as f:
    pickle.dump(lr_clf, f)

# 2. Save the column information to a JSON file
# We convert all column names to lowercase for easier matching in the web app
columns = {
    'data_columns' : [col.lower() for col in X.columns]
}
with open("columns.json", "w") as f:
    f.write(json.dumps(columns))

print("Success! 'lahore_home_prices_model.pickle' and 'columns.json' are ready.")

Success! 'lahore_home_prices_model.pickle' and 'columns.json' are ready.